app/views/events/index.html.erb

SELECT "actions".* FROM "actions" WHERE "actions"."event_id" = ?  [["event_id", 1]]
---

      <% event.actions.each do |action| %>