app/views/projects/show.html.erb

<ui>
<% @project.events.each do |e| %>
---
SELECT "events".* FROM "events" WHERE "events"."project_id" = 28