app/controllers/events_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."pjname" = 'hoge' LIMIT 1
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]
---
  def create

    #パラメタの取得
    #events = event_params
    project = event_params

    logger.debug("=============destroy=================");

    del = Project.find_by( pjname: project.pjname )
    logger.debug( del )
    del.destroy