app/controllers/projects_controller.rb

  def create

    project = event_params

    logger.debug("=============hoge=================");
    logger.debug( project.attributes )
    project.events.each do |e|
      logger.debug( e.attributes )
      e.actions.each do |p|
        logger.debug( p.attributes )
      end
    end

    before_project = Project.find_by( user_id: project.user_id,
                                     pjname: project.pjname )
    if !before_project.nil?
      before_project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 'test' AND "projects"."pjname" = 'hoge' LIMIT 1
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]