app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = 'test'
---
  def index
    @projects = Project.where( user_id: 'test' )

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "28"]]
---
  def show

    logger.debug("########Show######")
    @project = Project.find( params[:id] )

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 18]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "27"]]
---
  def destroy
    @project = Project.find( params[:id] ).destroy

SELECT "events".* FROM "events" WHERE "events"."project_id" = 1
INSERT INTO "events" ("created_at", "event", "id", "operator", "param", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Tue, 10 Mar 2015 07:56:57 UTC +00:00], ["event", "saw"], ["id", 1], ["operator", "=="], ["param", "FACE"], ["project_id", 1], ["updated_at", Tue, 10 Mar 2015 07:56:57 UTC +00:00]]
INSERT INTO "projects" ("created_at", "pjname", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 10 Mar 2015 07:40:13 UTC +00:00], ["pjname", "hoge3"], ["updated_at", Tue, 10 Mar 2015 07:40:13 UTC +00:00], ["user_id", "test"]]
---
  def create

    @project = event_params

    logger.debug("=============hoge=================");
    logger.debug( @project.attributes )
    @project.events.each do |e|
      logger.debug( e.attributes )
      e.actions.each do |p|
        logger.debug( p.attributes )
      end
    end

    #before_project = Project.find_by( user_id: @project.user_id,
    #                                 pjname: @project.pjname )

    #if !before_project.nil?
    #  before_project.destroy
    #  logger.debug("=============destory=================");
    #end

    logger.debug("=============piyo=================");

    @project.save